/*******************(C) COPYRIGHT 2021 Masses-Chip ****************************
* Project Name       : M9F951_USART.Prj
* File Name          : M9F951_USART.C
* Author             : MASSES CHIP
* Version            : V2.00
* Date               : 2021/09/15
* Web    			 : www.masses-chip.com
* FAE				 : Luo
*  				 	 : QQ：2546077008
*******************************************************************************
*
*Option:16M/16T,WDT-Enable-288ms,RST-IO,BOR 2.4V 
*说明：本USART范例每100ms发送一次数据0x55；TX0(IOF3)、RX0(IOF2),波特率为38400
*将接收到的数据格式正确的存放在R_RX_Data_Right，格式错误的存放在R_RX_Data_Error
******************************************************************************/
//=============================================================================
//*******************************头文件和调用申明******************************
//=============================================================================
//用户不可更改
#include "zc.h"
#include "MASSESCHIP_DEFINE.H"


//-----------------------------------------------------------------------------
//用户可以自行更改
void SYSTEM_INIT(void);						//系统初始化
void USART_INIT(void);						//USART初始化
void USART_Recive_Interrupt(void);			//USART接收中断处理函数
void USART_Send_Data(unsigned char R_Data);	//发送数据
void Delay_100ms(void);						//延时100ms


//-----------------------------------------------------------------------------
//定义变量
volatile unsigned char R_RX_Data_Right;		//存放接收到格式正确的数据
volatile unsigned char R_RX_Data_Error;		//存放接收到格式错误的数据


//=============================================================================
//********************************程序主函数***********************************
//=============================================================================
void main(void)					  		//程序主函数
{
	SYSTEM_INIT();						//系统初始化
	USART_INIT();						//USART初始化
	while(1)
	{
		CLRWDT();						//清除看门狗
		Delay_100ms();
		USART_Send_Data(0x55);
	}
}

		
//=============================================================================
//********************************串口发送程序*********************************
//=============================================================================
void USART_Send_Data(unsigned char R_Data)
{
	TX0REG = R_Data;
	while(T0MCLR==0);
}
//=============================================================================
//******************************中断服务子程序*********************************
//高优先级中断入口需调用空函数做断点保护
//注：中断处理调用子函数处理，不要再这里直接处理
//=============================================================================
void interrupt high_priority Intr(void)
{
	#asm
		call  _breakpoint_protect,f
	#endasm
	USART_Recive_Interrupt();

}
//=============================================================================
//**********************************空函数*************************************
//空函数做断点保护
//用户不可更改
//=============================================================================
void breakpoint_protect()
{

}

//=============================================================================
//***************************USART接收中断处理函数*****************************
//接收数据，检测数据格式是否出错，正确放入R_RX_Data_Right，错误放入R_RX_Data_Error
//注：中断接收标志由硬件清零
//=============================================================================
void USART_Recive_Interrupt(void)
{
	if(RX0IF==1)
	{
		if(FR0ER==0)
		{
			R_RX_Data_Right=RX0REG;
		}
		else
		{
			R_RX_Data_Error=RX0REG;
		}
	}
}

//=============================================================================
//*********************************USART初始化*********************************
//端口设置：RX0(IOF2)接收端口设为输入，TX0(IOF3)发送端口设为输出
//波特率设置：目标波特率=Fosc/（（BRGD+1）×n）=38400
//开启USART接收中断和总中断，关闭发送中断
//=============================================================================
void USART_INIT(void)
{
//1、端口设置
	OEF2 = 0;
	OEF3 = 1;
//2、USART设置
	TX0CR = 0x80;
	RX0CR = 0x80;
//3、波特率设置
	BRGD0H = 0x00;
	BRGD0L = 0x67;
//4、中断设置
	RX0IF = 0;
	TX0IF = 0;
	TX0IE = 0;
	RX0IE = 1;
	GIEH = 1;
}


//=============================================================================
//********************************延时函数*************************************
//延时100ms
//=============================================================================
void Delay_100ms(void)
{
	unsigned int i;
	unsigned int j;
	for(i=140;i>0;i--)
	{
		for(j=100;j>0;j--);
	}
}
//=============================================================================
//*********************************系统初始化**********************************
//系统时钟初始化：快钟、慢钟都正常工作，不进休眠
//IO初始化:设置个IO状态为输出低，且关闭上下拉
//中断总开关：关闭总开关
//=============================================================================	
void SYSTEM_INIT(void)
{
//----------------------------------------------------
//Init Clock
	OSCM = 0x00;
//----------------------------------------------------	            
//Init IO
	//IOA
	ANSA = 0x00;               //0:数字口	1:模拟口 
	PUA = 0x00;                //0:上拉关闭 1:上拉使能
	PDA = 0x00;				   //0:下拉关闭 1:下拉使能
	IOA = 0x00;                //IO口数据
	OEA = 0xFF;                //0:输入 1:输出
	//IOB
	ANSB = 0x00;
	PUB = 0x00;
	PDB = 0x00;
	IOB = 0x00;
	OEB = 0xFF;
	//IOC
	ANSC = 0x00;
	PUC = 0x00;
	PDC = 0x00;
	IOC = 0x00;
	OEC = 0xFF;
	//IOD
	ANSD = 0x00;
	PUD = 0x00;
	PDD = 0x00;
	IOD = 0x00;
	OED = 0xFF;
	//IOE
	ANSE = 0x00;
	PUE = 0x00; 
	PDE = 0x00;
	IOE = 0x00;
	OEE = 0xFF;
	//IOF
	ANSF = 0x00;
	PUF = 0x00;
	PDF = 0x00;
	IOF = 0x00;
	OEF = 0xFF;
//----------------------------------------------------     
//Init Interrupt
	GIEL = 0;                  //1:全局中断低优先级中断使能,0:屏蔽全局中断低优先级中断
	GIEH = 0;                  //1:全局中断高优先级中断使能,0:屏蔽全局中断高优先级中断
}

//*********************************END OF FILE**********************************