#include"zc.h"
#include"DELAY.H"

/************************************************************
本工程使用了两种方式进行延时：
1、使用官方库里的内联函数延时，多次使用时需注意会增大空间开销
2、自编写的延时函数。
**************************************************************/

#define _Fcpu 6000000	//内联库使用,填入当前cpu速度

void main()
{
	ANSF = 0;
	OEF = 0XFF;
	IOF0 = 1;
	IOF1 = 1;
	ANSA = 0;
	OEA2 = 1;
	IOA2 = 0;
	OEA3 = 1;
	IOA3 = 0;
	
	while(1)
	{
		IOA2 = 1;
		Delayms(500);	//使用自编写延时
		IOA2 = 0;
	/*	
		IOA2 = 1;
		Delayus(100);	//使用自编写延时
		IOA2 = 0;
		
		IOA3 = 1;
		__delay_ms(500);	//使用库内联函数
		IOA3 = 0;
		
		IOA3 = 1;
		__delay_us(100);	//使用库内联函数
		IOA3 = 0;*/
	}
}