      /*******************(C) COPYRIGHT 2021 Masses-Chip ****************************
* Project Name       : M9F951_SPI_Master.prj
* File Name          : M9F951_SPI_Master.C
* Author             : MASSES CHIP
* Version            : V2.00
* Date               : 2021/09/15
* Web    			 : www.masses-chip.com
* FAE				 : Luo
*  				 	 : QQ：411680975
*******************************************************************************
*
*Option:16M/16T,WDT-Disable-288ms,RST-IO,BOR 2.4V 
*说明：端口SS0(IOF7)、SCK0(IOF6)、SDO0(IOF5)、SDI0(IOF4)，
*向从机发送SPI_SBUF数组中的数据，接收从机发送的数据存放在SPI_RBUF.
******************************************************************************/
//=============================================================================
//*******************************头文件和调用申明******************************
//=============================================================================
//用户不可更改
#include "zc.h"
#include "MASSESCHIP_DEFINE.H"


//-----------------------------------------------------------------------------
//用户可以自行更改
void SYSTEM_INIT(void);						//系统初始化
void SPI_Master_INIT(void);					//SPI主机初始化
void SPI_Send_Data(void);					//SPI发送数据
void Delay_1ms(void);					    //延时
void spi_interrupt(void);
void SPI_SEND_INIT(void);	
//-----------------------------------------------------------------------------
//定义变量
volatile unsigned char SPI_Receive_Data;
unsigned char SPI_RBUF		@(0x20);
unsigned char SPI_SBUF[20]	@(0x40);

ob8 flag;
#define spi_flag flag.b0


//=============================================================================
//********************************程序主函数***********************************
//=============================================================================
void main(void)					  		//程序主函数
{
	SYSTEM_INIT();                  	//系统初始化
	SPI_Master_INIT();					//SPI主机初始化
	SPI_SEND_INIT();
	while(1)
	{
		CLRWDT();						//清除看门狗
		SPI_Send_Data();
		Delay_1ms();
	}
}

//=============================================================================
//********************************SPI发送数据**********************************
//=============================================================================
void SPI_Send_Data(void)
{
	IOF7=0;
	unsigned char i,j;
	for(i=0;i<20;i=i+4)
	{
		for(j=0;j<4;j++)
		{
			I2C0DBUF = SPI_SBUF[j+i];		//N=4，主机每次发送4个数据
		}
		while(spi_flag==0);
		spi_flag = 0;	
		Delay_1ms();		
	}
	IOF7=1;
}


//=============================================================================
//********************************延时函数*************************************
//=============================================================================
void Delay_1ms(void)
{
	unsigned char i;
	for(i=25;i>0;i--)
	{
	
	}
}

void SPI_SEND_INIT(void)
{    
	unsigned char i;
	for(i=0;i<=20;i++)
	{
		SPI_SBUF[i] = i;
	}
}


//=============================================================================
//******************************中断服务子程序*********************************
//高优先级中断入口需调用空函数做断点保护
//注：中断处理调用子函数处理，不要再这里直接处理
//=============================================================================
void interrupt high_priority Intr(void)
{
	#asm
		call  _breakpoint_protect,f
	#endasm
	spi_interrupt();
	

}
//=============================================================================
//**********************************空函数*************************************
//空函数做断点保护
//用户不可更改
//=============================================================================
void breakpoint_protect()
{

}


void spi_interrupt()
{
	if(I2C0IF==1)
	{
		SPI_RBUF = I2C0DBUF;		//读取从机发送的数据，数据完全读完I2C0IF为0
		spi_flag = 1;
	}
}





//=============================================================================
//*******************************SPI主机初始化*********************************
//端口设置：发送口设置为输出模式，接收口设置为输入模式
//SPI主机设置：作为主机，MSB优先，需要片选信号
//=============================================================================
void SPI_Master_INIT(void)
{
//1、端口设置
	OEF7 = 1;			;//SS0
	IOE7 = 1;
	OEF6 = 1;			;//SCK0
	OEF5 = 1;			;//SDO0
	OEF4 = 0;			;//SDI0
	ANSF = 0x00;
//2、SPI设置
	I2C0CR1 = 0x48;
	I2C0CR2 = 0x00;
	I2C0PRESC = 0x07;
	I2C0IF = 0;
	I2C0IE = 1;
	GIEH = 1;		
	C0NT0 = 1 ;
	C0NT1 = 1;
	
	
	
}
//=============================================================================
//*********************************系统初始化**********************************
//系统时钟初始化：快钟、慢钟都正常工作，不进休眠
//IO初始化:设置个IO状态为输出低，且关闭上下拉
//中断总开关：关闭总开关
//=============================================================================	
void SYSTEM_INIT(void)
{
//----------------------------------------------------
//Init Clock
	OSCM = 0x00;
//----------------------------------------------------	            
//Init IO
	//IOA
	ANSA = 0x00;               //0:数字口	1:模拟口 
	PUA = 0x00;                //0:上拉关闭 1:上拉使能
	PDA = 0x00;				   //0:下拉关闭 1:下拉使能
	IOA = 0x00;                //IO口数据
	OEA = 0xFF;                //0:输入 1:输出
	//IOB
	ANSB = 0x00;
	PUB = 0x00;
	PDB = 0x00;
	IOB = 0x00;
	OEB = 0xFF;
	//IOC
	ANSC = 0x00;
	PUC = 0x00;
	PDC = 0x00;
	IOC = 0x00;
	OEC = 0xFF;
	//IOD
	ANSD = 0x00;
	PUD = 0x00;
	PDD = 0x00;
	IOD = 0x00;
	OED = 0xFF;
	//IOE
	ANSE = 0x00;
	PUE = 0x00; 
	PDE = 0x00;
	IOE = 0x00;
	OEE = 0xFF;
	//IOF
	ANSF = 0x00;
	PUF = 0x00;
	PDF = 0x00;
	IOF = 0x00;
	OEF = 0xFF;
//----------------------------------------------------     
//Init Interrupt
	GIEL = 0;                  //1:全局中断低优先级中断使能,0:屏蔽全局中断低优先级中断
	GIEH = 0;                  //1:全局中断高优先级中断使能,0:屏蔽全局中断高优先级中断
}

//*********************************END OF FILE***********************************