/*******************(C) COPYRIGHT 2021 Masses-Chip ****************************
* Project Name       : M9F951_I2C_Slave.Prj
* File Name          : M9F951_I2C_Slave.C
* Author             : MASSES CHIP
* Version            : V2.00
* Date               : 2021/09/15
* Web    			 : www.masses-chip.com
* FAE				 : Luo
*  				 	 : QQ：2546077008
*******************************************************************************
*
*Option:16M/16T,WDT-Enable-288ms,RST-IO,BOR 2.4V 
*说明:本范例为IIC主机模式，数据线SDA0(IOF5)、时钟线SCL0(IOF6)；
*包括主机的写与读操作，主机在从机RAM区0x20开始写入数据0x55、0xAA、0xFF，
*主机读取从机的数据在RAM区0x20开始存放
*设备地址为0xA0
******************************************************************************/
//=============================================================================
//*******************************头文件和调用申明******************************
//=============================================================================
//用户不可更改
#include "zc.h"
#include "MASSESCHIP_DEFINE.H"


//-----------------------------------------------------------------------------
//用户可以自行更改
void SYSTEM_INIT(void);					//系统初始化
void I2C_Slave_INIT(void);				//I2C从机初始化
void I2C_Interrupt(void);				//I2C中断处理
void I2C_Slave_Work(void);				//I2C从机工作

//-----------------------------------------------------------------------------
//定义变量
volatile unsigned char	sFSR0H;
volatile unsigned char	sFSR0L;

//=============================================================================
//********************************程序主函数***********************************
//=============================================================================
void main(void)					  		//程序主函数
{
	SYSTEM_INIT();						//系统初始化
	I2C_Slave_INIT();					//I2C从机初始化
	while(1)
	{
		CLRWDT();						//清除看门狗
	}
}

//=============================================================================
//******************************中断服务子程序*********************************
//高优先级中断入口需调用空函数做断点保护
//注：中断处理调用子函数处理，不要再这里直接处理
//=============================================================================
void interrupt high_priority Intr(void)
{
	#asm
		call  _breakpoint_protect,f
	#endasm
	I2C_Interrupt();

}
//=============================================================================
//**********************************空函数*************************************
//空函数做断点保护
//用户不可更改
//=============================================================================
void breakpoint_protect()
{

}

//=============================================================================
//******************************中断服务子程序*********************************
//中断进入前保存FSR，中断会使用到，防止被修改
//=============================================================================
void I2C_Interrupt(void)
{
	sFSR0H=FSR0H;
	sFSR0L=FSR0L;
	if(I2C0IF==1)
	{
		I2C_Slave_Work();
	}
	FSR0H=sFSR0H;
	FSR0L=sFSR0L;
}

//=============================================================================
//*******************************I2C从机初始化*********************************
//端口设置：IOF5(SDA0)、IOF6(SCL0)端口上拉、输入
//I2C 设置：使能串行通讯功能，从机地址为0xA0
//中断设置：开启I2C中断与总中断
//=============================================================================
void I2C_Slave_INIT(void)
{
//1、端口设置
	PUF5 = 1;			;//SDA0
	OEF5 = 0;
	PUF6 = 1;			;//SCL0
	OEF6 = 0;
//2、I2C设置
	I2C0CR1 = 0x80;
	I2C0CR2 = 0x00;
	I2C0PRESC = 0x0F;
//3、设置从机地址
	I2C0OAR = 0x02;
//4、中断设置
	I2C0IF = 0;
	I2C0IE = 1;
	GIEH = 1;
}

//=============================================================================
//*********************************系统初始化**********************************
//系统时钟初始化：快钟、慢钟都正常工作，不进休眠
//IO初始化:设置个IO状态为输出低，且关闭上下拉
//中断总开关：关闭总开关
//=============================================================================	
void SYSTEM_INIT(void)
{
//----------------------------------------------------
//Init Clock
	OSCM = 0x00;
//----------------------------------------------------	            
//Init IO
	//IOA
	ANSA = 0x00;               //0:数字口	1:模拟口 
	PUA = 0x00;                //0:上拉关闭 1:上拉使能
	PDA = 0x00;				   //0:下拉关闭 1:下拉使能
	IOA = 0x00;                //IO口数据
	OEA = 0xFF;                //0:输入 1:输出
	//IOB
	ANSB = 0x00;
	PUB = 0x00;
	PDB = 0x00;
	IOB = 0x00;
	OEB = 0xFF;
	//IOC
	ANSC = 0x00;
	PUC = 0x00;
	PDC = 0x00;
	IOC = 0x00;
	OEC = 0xFF;
	//IOD
	ANSD = 0x00;
	PUD = 0x00;
	PDD = 0x00;
	IOD = 0x00;
	OED = 0xFF;
	//IOE
	ANSE = 0x00;
	PUE = 0x00; 
	PDE = 0x00;
	IOE = 0x00;
	OEE = 0xFF;
	//IOF
	ANSF = 0x00;
	PUF = 0x00;
	PDF = 0x00;
	IOF = 0x00;
	OEF = 0xFF;
//----------------------------------------------------     
//Init Interrupt
	GIEL = 0;                  //1:全局中断低优先级中断使能,0:屏蔽全局中断低优先级中断
	GIEH = 0;                  //1:全局中断高优先级中断使能,0:屏蔽全局中断高优先级中断
}


//*********************************END OF FILE**********************************