/*******************(C) COPYRIGHT 2021 Masses-Chip ****************************
* Project Name       : M9F951_PWM2.prj
* File Name          : M9F951_PWM2.C
* Author             : MASSES CHIP
* Version            : V2.00
* Date               : 2021/09/15
* Web    			 : www.masses-chip.com
* FAE				 : Luo
*  				 	 : QQ：411680975
*******************************************************************************
*
*Option:16M/16T,WDT-Enable-288ms,RST-IO,BOR 2.4V 
*说明：本范例以系统时钟为时基，产生1KHz，占空比为50%前、后死区时间5.25us的PWM波形
*PWM输出口为PWM2_0PA(IOE0)、PWM2_0NA(IOE1)、PWM2_1PA(IOE2)、PWM2_1NA(IOE3)、
*PWM2_2PA(IOE4)、PWM2_2NA(IOE5)
*PWM波形每100Ms开关一次
******************************************************************************/
//=============================================================================
//*******************************头文件和调用申明******************************
//=============================================================================
//用户不可更改
#include "zc.h"
#include "MASSESCHIP_DEFINE.H"


//-----------------------------------------------------------------------------
//用户可以自行更改
void SYSTEM_INIT(void);					//系统初始化
void PWM2_INIT(void);					//PWM1初始化
void Delay_100ms(void);					//延时100ms


//=============================================================================
//********************************程序主函数***********************************
//=============================================================================
void main(void)					  		//程序主函数
{
	SYSTEM_INIT();						//系统初始化
	PWM2_INIT();						//PWM2初始化
	while(1)
	{
		CLRWDT();						//清除看门狗
		PWM2RLDEN = 0x55;
		PWM2_0POE = 1;
		PWM2_0NOE = 1;
		PWM2_1POE = 1;
		PWM2_1NOE = 1;
		PWM2_2POE = 1;
		PWM2_2NOE = 1;
		Delay_100ms();
		PWM2_0POE = 0;
		PWM2_0NOE = 0;
		PWM2_1POE = 0;
		PWM2_1NOE = 0;
		PWM2_2POE = 0;
		PWM2_2NOE = 0;
		Delay_100ms();		
		PWM2RLDEN = 0xAA;
	}
}
//=============================================================================
//******************************中断服务子程序*********************************
//高优先级中断入口需调用空函数做断点保护
//注：中断处理调用子函数处理，不要再这里直接处理
//=============================================================================
void interrupt high_priority Intr(void)
{
	#asm
		call  _breakpoint_protect,f
	#endasm
}
//=============================================================================
//**********************************空函数*************************************
//空函数做断点保护
//用户不可更改
//=============================================================================
void breakpoint_protect()
{

}

//=============================================================================
//*********************************PWM2初始化**********************************
//PWM2RLDEN寄存器写入0x55，允许软件对模块寄存器的修改
//PWM2时基设置：16M，无预分频，无后分频，中心对齐模式
//PWM2设置：互补输出，频率1KHz，前后死区5.25us，占空比50% 
//=============================================================================
void PWM2_INIT(void)
{
//1、PWM2设置
	PWM2RLDEN =0x55;			;//允许修改PWM2相关寄存器
	PWM2CR0 = 0x10;
	PWM2CR1 = 0x00;
	PWM2CR2 = 0x08;
	PWM2OE = 0x00;
	PMANUALCR1 = 0x3F;
	PMANUALCR0 = 0x00;
	FLTCR = 0x00;

//2、周期设置
	PWM2PRL = 0x40;
	PWM2PRH = 0x1F;

//3、死区设置
	PWM2DT0L = 0x55;
	PWM2DT0H = 0x00;
	PWM2DT1L = 0x55;
	PWM2DT1H = 0x00;

//4、占空比设置
	PWM2_0PL = 0xA0;
	PWM2_0PH = 0x0F;
	PWM2_0NL = 0xA0;
	PWM2_0NH = 0x0F;
	PWM2_1PL = 0xA0;
	PWM2_1PH = 0x0F;
	PWM2_1NL = 0xA0;
	PWM2_1NH = 0x0F;
	PWM2_2PL = 0xA0;
	PWM2_2PH = 0x0F;
	PWM2_2NL = 0xA0;
	PWM2_2NH = 0x0F;

//5、使能输出，允许重载
	PWM2EN = 1;
	PWM2RLDEN = 0xAA;
}


//=============================================================================
//*********************************延时函数************************************
//=============================================================================
void Delay_100ms(void)
{
	unsigned int i;
	unsigned int j;
	for(i=143;i>0;i--)
	{
		for(j=100;j>0;j--);
	}
}
//=============================================================================
//*********************************系统初始化**********************************
//系统时钟初始化：快钟、慢钟都正常工作，不进休眠
//IO初始化:设置个IO状态为输出低，且关闭上下拉
//中断总开关：关闭总开关
//=============================================================================	
void SYSTEM_INIT(void)
{
//----------------------------------------------------
//Init Clock
	OSCM = 0x00;
//----------------------------------------------------	            
//Init IO
	//IOA
	ANSA = 0x00;               //0:数字口	1:模拟口 
	PUA = 0x00;                //0:上拉关闭 1:上拉使能
	PDA = 0x00;				   //0:下拉关闭 1:下拉使能
	IOA = 0x00;                //IO口数据
	OEA = 0xFF;                //0:输入 1:输出
	//IOB
	ANSB = 0x00;
	PUB = 0x00;
	PDB = 0x00;
	IOB = 0x00;
	OEB = 0xFF;
	//IOC
	ANSC = 0x00;
	PUC = 0x00;
	PDC = 0x00;
	IOC = 0x00;
	OEC = 0xFF;
	//IOD
	ANSD = 0x00;
	PUD = 0x00;
	PDD = 0x00;
	IOD = 0x00;
	OED = 0xFF;
	//IOE
	ANSE = 0x00;
	PUE = 0x00; 
	PDE = 0x00;
	IOE = 0x00;
	OEE = 0xFF;
	//IOF
	ANSF = 0x00;
	PUF = 0x00;
	PDF = 0x00;
	IOF = 0x00;
	OEF = 0xFF;
//----------------------------------------------------     
//Init Interrupt
	GIEL = 0;                  //1:全局中断低优先级中断使能,0:屏蔽全局中断低优先级中断
	GIEH = 0;                  //1:全局中断高优先级中断使能,0:屏蔽全局中断高优先级中断
}

//*********************************END OF FILE**********************************