/*******************(C) COPYRIGHT 2021 Masses-Chip ****************************
* Project Name       : M9F951_I2C_Slave.Prj
* File Name          : M9F951_I2C_Slave.C
* Author             : MASSES CHIP
* Version            : V3.00
* Date               : 2022/09/09
* Web    			 : www.masses-chip.com
* FAE				 : Luo
*  				 	 : QQ：2546077008
*******************************************************************************
*
*Option:16M/16T,WDT-Enable-288ms,RST-IO,BOR 2.4V 
*说明:本范例为IIC主机模式，数据线SDA0(IOF5)、时钟线SCL0(IOF6)；
*从机接收多个数据时注意事项
*要求主机在发送完数据后要有stop信号
*要求主机在写数据时不要有大于超时信号的延迟
*要求主机在接收数据时，发送器件地址后要有大于超时信号的延时
*在初始化后设置N值为1，在接收器件地址后设置需要的N值
*在超时检测后设置N值为1
*超时检测应该为大于传输N个数据需要的时间，此范例设置的时间为2ms
*主机读写间隔时间要大于超时检测时间
******************************************************************************/
//=============================================================================
//*******************************头文件和调用申明******************************
//=============================================================================
//用户不可更改
#include "zc.h"
#include "MASSESCHIP_DEFINE.H"


//-----------------------------------------------------------------------------
//用户可以自行更改
void SYSTEM_INIT(void);					//系统初始化
void I2C_Slave_INIT(void);				//I2C从机初始化
void I2C_Interrupt(void);				//I2C中断处理
void I2C_Slave_Work(void);				//I2C从机工作
void TC_INIT(void);
//-----------------------------------------------------------------------------
//定义变量
#define	 time_delay			249			//设置超时时间
unsigned char	i2c_buf[20] @(0x020);	
unsigned char	R_Count;

//=============================================================================
//********************************程序主函数***********************************
//=============================================================================
void main(void)					  		//程序主函数
{
	SYSTEM_INIT();						//系统初始化
	I2C_Slave_INIT();					//I2C从机初始化
	TC_INIT();							//定时器初始化
	while(1)
	{
		CLRWDT();						//清除看门狗
	}
}

//=============================================================================
//******************************中断服务子程序*********************************
//高优先级中断入口需调用空函数做断点保护
//注：中断处理调用子函数处理，不要再这里直接处理
//=============================================================================
void interrupt high_priority Intr(void)
{
	#asm
		call  _breakpoint_protect,f
	#endasm
	I2C_Interrupt();

}
//=============================================================================
//**********************************空函数*************************************
//空函数做断点保护
//用户不可更改
//=============================================================================
void breakpoint_protect()
{

}

//=============================================================================
//******************************中断服务子程序*********************************
//中断进入前保存FSR，中断会使用到，防止被修改
//=============================================================================
void I2C_Interrupt(void)
{
	if(TC0IF==1)
	{
		TC0IF = 0;				//超时处理程序
		TC0EN = 0;				//关闭超时检测
		I2C0CR1 = 0x80;			//N=1
		R_Count = 0;		
	}
	
	else if(I2C0IF==1)
	{
		I2C_Slave_Work();
	}
}


//=============================================================================
//*******************************TC0定时器设置*********************************
//进行超时检测，时间为2ms
//=============================================================================
void TC_INIT(void)
{
	T0CR = 0x0F;
	TC0CH = 0;
	TC0CL = time_delay;
	TC0IF = 0;
	TC0IE = 1;
	TC0EN = 0;
	GIEH = 1;
}




//=============================================================================
//*******************************I2C从机初始化*********************************
//端口设置：IOF5(SDA0)、IOF6(SCL0)端口上拉、输入
//I2C 设置：使能串行通讯功能，从机地址为0xA0
//中断设置：开启I2C中断与总中断
//=============================================================================
void I2C_Slave_INIT(void)
{
//1、端口设置
	PUF5 = 1;			;//SDA0
	OEF5 = 0;
	PUF6 = 1;			;//SCL0
	OEF6 = 0;
//2、I2C设置
	I2C0CR1 = 0x80;
	I2C0CR2 = 0x00;
	I2C0PRESC = 0x07;
//3、设置从机地址
	I2C0OAR = 0xA0;
//4、中断设置
	I2C0IF = 0;
	I2C0IE = 1;
	GIEH = 1;
}

//=============================================================================
//*********************************系统初始化**********************************
//系统时钟初始化：快钟、慢钟都正常工作，不进休眠
//IO初始化:设置个IO状态为输出低，且关闭上下拉
//中断总开关：关闭总开关
//=============================================================================	
void SYSTEM_INIT(void)
{
//----------------------------------------------------
//Init Clock
	OSCM = 0x00;
//----------------------------------------------------	            
//Init IO
	//IOA
	ANSA = 0x00;               //0:数字口	1:模拟口 
	PUA = 0x00;                //0:上拉关闭 1:上拉使能
	PDA = 0x00;				   //0:下拉关闭 1:下拉使能
	IOA = 0x00;                //IO口数据
	OEA = 0xFF;                //0:输入 1:输出
	//IOB
	ANSB = 0x00;
	PUB = 0x00;
	PDB = 0x00;
	IOB = 0x00;
	OEB = 0xFF;
	//IOC
	ANSC = 0x00;
	PUC = 0x00;
	PDC = 0x00;
	IOC = 0x00;
	OEC = 0xFF;
	//IOD
	ANSD = 0x00;
	PUD = 0x00;
	PDD = 0x00;
	IOD = 0x00;
	OED = 0xFF;
	//IOE
	ANSE = 0x00;
	PUE = 0x00; 
	PDE = 0x00;
	IOE = 0x00;
	OEE = 0xFF;
	//IOF
	ANSF = 0x00;
	PUF = 0x00;
	PDF = 0x00;
	IOF = 0x00;
	OEF = 0xFF;
//----------------------------------------------------     
//Init Interrupt
	GIEL = 0;                  //1:全局中断低优先级中断使能,0:屏蔽全局中断低优先级中断
	GIEH = 0;                  //1:全局中断高优先级中断使能,0:屏蔽全局中断高优先级中断
}


//*********************************END OF FILE**********************************