//=============================================================================
//*******************************头文件和调用申明******************************
//=============================================================================
//用户不可更改
#include "zc.h"
#include "MASSESCHIP_DEFINE.H"

//-----------------------------------------------------------------------------
//用户可以自行更改
void I2C_Master_Write(void);				//主机写
void I2C_Send_Data(unsigned char R_Data);	//I2C主机发送数据
void I2C_Master_Read(void);					//主机读
//-----------------------------------------------------------------------------
//定义变量
volatile unsigned char R_Temp;
volatile unsigned char R_Count;			//计数
volatile unsigned char R_Data_Address;	//数据地址

//==============================================================================
//*******************************I2C主机写数据**********************************
//在从机RAM的0x20处开始写入0x55、0xAA、0xFF
//==============================================================================
void I2C_Master_Write(void)
{
	C0SR=1;
	
	I2C_Send_Data(0xA0);
	I2C_Send_Data(0x20);
	
	I2C_Send_Data(0x55);
	I2C_Send_Data(0xAA);
	I2C_Send_Data(0xFF);
	
	C0SP=1;
	#asm
	NOP
	#endasm
}
//----------------------------------------------
//I2C主机数据发送
void I2C_Send_Data(unsigned char R_Data)
{
	I2C0DBUF=R_Data;
	while(C0BF==0);
}

//==============================================================================
//*******************************I2C主机读数据**********************************
//主机向从机读取数据，在RAM区的0x20开始存放
//==============================================================================
void I2C_Master_Read(void)
{
	C0ACK=0;
	I2C0DBUF=0xA0;
	I2C0DBUF=0x20;
	C0SR=1;
	while(C0BF==0);
	C0SR=1;
	I2C_Send_Data(0xA1);
	I2C0DBUF=0;
	do
	{
		while(C0BF==0);
		R_Count--;
		if(R_Count==0)
		{
			C0ACK=1;
		}
		FSR0H=0x00;
		FSR0L=R_Data_Address;
		INDF0=I2C0DBUF;
		R_Data_Address++;
	}
	while(R_Count>0);
	while(C0BF==0);
	R_Temp=I2C0DBUF;
	C0SP=1;
	while(C0SP==1);
}
//********************************END OF FILE***********************************
