/*******************(C) COPYRIGHT 2021 Masses-Chip ****************************
* Project Name       : M9F951_IOA2_Interrupt.prj
* File Name          : M9F951_IOA2_Interrupt.C
* Author             : MASSES CHIP
* Version            : V2.00
* Date               : 2021/09/15
* Web    			 : www.masses-chip.com
* FAE				 : Luo
*  				 	 : QQ：411680975
*******************************************************************************
*
*Option:16M/16T,WDT-Disable-288ms,RST-IO,BOR 2.4V 
*说明：本范例在休眠模式下开启IOA2端口外部中断，触发IO变化中断翻转一次IOB0口
******************************************************************************/
//=============================================================================
//*******************************头文件和调用申明******************************
//=============================================================================
//用户不可更改
#include "zc.h"
#include "MASSESCHIP_DEFINE.H"


//-----------------------------------------------------------------------------
//用户可以自行更改
void SYSTEM_INIT(void);					//系统初始化
void IOA2_Interrupt_INIT(void);			//IOA2外部中断初始化
void IOA2_Interrupt(void);				//IOA2外部中断处理函数

//-----------------------------------------------------------------------------
//定义变量
volatile ab8 R_Flag;			//定义位寄存器
#define		b_IOA2_F		R_Flag.oneBit.b0

//=============================================================================
//********************************程序主函数***********************************
//主函数循环：CPU停止工作，判断是否有设置的IOC0外部中断标志位，翻转IOB0端口
//=============================================================================
void main(void)					  		//程序主函数
{
	SYSTEM_INIT();                  	//系统初始化
	IOA2_Interrupt_INIT();				//IOA2外部中断初始化
	while(1)
	{
		if(b_IOA2_F==1)
		{
			b_IOA2_F=0;
			if(IOB0==1)
			{
				IOB=0;
			}
			else if(IOB0==0)
			{
				IOB0=1;
			}
		}
		STOP = 1;
	}
}
//=============================================================================
//******************************中断服务子程序*********************************
//高优先级中断入口需调用空函数做断点保护
//注：中断处理调用子函数处理，不要再这里直接处理
//=============================================================================
void interrupt high_priority Intr(void)
{
	#asm
		call  _breakpoint_protect,f
	#endasm
	IOA2_Interrupt();

}
//=============================================================================
//**********************************空函数*************************************
//空函数做断点保护
//用户不可更改
//=============================================================================
void breakpoint_protect()
{

}

//=============================================================================
//****************************IOA外部中断处理函数******************************
//触发外部中断设置一次IOA2中断标志位
//=============================================================================
void IOA2_Interrupt(void)
{
	if(IOACHIF==1)
	{
		IOACHIF = 0;
		b_IOA2_F = 1;
	}
}


//=============================================================================
//*****************************IOA2外部中断初始化******************************
//IOA2端口设置：上拉，输入
//开启IOA端口变化中断、使能IOA2端口电平变化中断、开启总中断
//OSCM设置：休眠状态下关闭高/低频振荡器
//=============================================================================
void IOA2_Interrupt_INIT(void)
{
//1、端口设置
	PUA2 = 1;
	OEA2 = 0;
//2、中断设置
	IOACHIF = 0;
	IOACHIE = 1;
	IOAICR2 = 1;
	GIEH = 1;
//3、休眠设置
	OSCM = 0x05;
}

//=============================================================================
//*********************************系统初始化**********************************
//系统时钟初始化：快钟、慢钟都正常工作，不进休眠
//IO初始化:设置个IO状态为输出低，且关闭上下拉
//中断总开关：关闭总开关
//=============================================================================	
void SYSTEM_INIT(void)
{
//----------------------------------------------------
//Init Clock
	OSCM = 0x00;
//----------------------------------------------------	            
//Init IO
	//IOA
	ANSA = 0x00;               //0:数字口	1:模拟口 
	PUA = 0x00;                //0:上拉关闭 1:上拉使能
	PDA = 0x00;				   //0:下拉关闭 1:下拉使能
	IOA = 0x00;                //IO口数据
	OEA = 0xFF;                //0:输入 1:输出
	//IOB
	ANSB = 0x00;
	PUB = 0x00;
	PDB = 0x00;
	IOB = 0x00;
	OEB = 0xFF;
	//IOC
	ANSC = 0x00;
	PUC = 0x00;
	PDC = 0x00;
	IOC = 0x00;
	OEC = 0xFF;
	//IOD
	ANSD = 0x00;
	PUD = 0x00;
	PDD = 0x00;
	IOD = 0x00;
	OED = 0xFF;
	//IOE
	ANSE = 0x00;
	PUE = 0x00; 
	PDE = 0x00;
	IOE = 0x00;
	OEE = 0xFF;
	//IOF
	ANSF = 0x00;
	PUF = 0x00;
	PDF = 0x00;
	IOF = 0x00;
	OEF = 0xFF;
//----------------------------------------------------     
//Init Interrupt
	GIEL = 0;                  //1:全局中断低优先级中断使能,0:屏蔽全局中断低优先级中断
	GIEH = 0;                  //1:全局中断高优先级中断使能,0:屏蔽全局中断高优先级中断
}


//*********************************END OF FILE**********************************